In [2]:
import pandas as pd

In [3]:
grades_dict = {
    'W': [65, 96, 87],
    'E': [100, 87, 90],
    'S': [94, 77, 90],
    'K': [98, 76, 52],
    'B': [78, 74, 82],
}

In [4]:
grades = pd.DataFrame(grades_dict)

In [5]:
grades

    W    E   S   K   B
0  65  100  94  98  78
1  96   87  77  76  74
2  87   90  90  52  82

In [6]:
# change index for the data frame
grades.index = ['Test1', 'Test2', 'Test3']

In [7]:
grades

        W    E   S   K   B
Test1  65  100  94  98  78
Test2  96   87  77  76  74
Test3  87   90  90  52  82

In [8]:
# Accessing Columns
grades['W']

Test1    65
Test2    96
Test3    87
Name: W, dtype: int64

In [9]:
# dot operator can be used if column names are valid names in python
grades.W

Test1    65
Test2    96
Test3    87
Name: W, dtype: int64

In [10]:
# Access rows using index names
# returns series with Column names as index
grades.loc['Test1']

W     65
E    100
S     94
K     98
B     78
Name: Test1, dtype: int64

In [11]:
# accessing rows using index number
grades.iloc[1]

W    96
E    87
S    77
K    76
B    74
Name: Test2, dtype: int64

In [14]:
#slice of rows
grades.loc['Test1':'Test2']

        W    E   S   K   B
Test1  65  100  94  98  78
Test2  96   87  77  76  74

In [16]:
# random rows selection by passing a list of indices
grades.loc[['Test1','Test3']]

        W    E   S   K   B
Test1  65  100  94  98  78
Test3  87   90  90  52  82

In [18]:
## random rows selection by passing a list of indices
grades.iloc[[0,2]]

        W    E   S   K   B
Test1  65  100  94  98  78
Test3  87   90  90  52  82

In [19]:
#Selecting slice of rows and then slice of coulmns for those rows
grades.loc['Test1':'Test2',['W','S']]

        W   S
Test1  65  94
Test2  96  77

In [21]:
grades.loc[['Test1','Test3'],['E','B']]

         E   B
Test1  100  78
Test3   90  82

In [22]:
# conditions with Pandas
grades > 80

           W     E      S      K      B
Test1  False  True   True   True  False
Test2   True  True  False  False  False
Test3   True  True   True  False   True

In [23]:
# to access values .. use this condition 
# NaN is where value is False
grades[grades > 80]

          W    E     S     K     B
Test1   NaN  100  94.0  98.0   NaN
Test2  96.0   87   NaN   NaN   NaN
Test3  87.0   90  90.0   NaN  82.0

In [26]:
((grades > 80) & (grades < 90))

           W      E      S      K      B
Test1  False  False  False  False  False
Test2  False   True  False  False  False
Test3   True  False  False  False   True

In [27]:
grades[(grades > 80) & (grades < 90)]

          W     E   S   K     B
Test1   NaN   NaN NaN NaN   NaN
Test2   NaN  87.0 NaN NaN   NaN
Test3  87.0   NaN NaN NaN  82.0

In [29]:
grades

        W    E   S   K   B
Test1  65  100  94  98  78
Test2  96   87  77  76  74
Test3  87   90  90  52  82

In [28]:
# Selecting Specific Values using 'at' and 'iat'
grades.at['Test1','W']

65

In [30]:
grades.iat[2,2]

90

In [34]:
# assigning value using at and iat
grades.at['Test1','W'] = 100

In [35]:
grades.at['Test1','W']

100

In [36]:
grades.iat[2,2] = 50

In [37]:
grades.iat[2,2]

50